#+TITLE: Project Notes


* Tasks
** DONE Implement structure for partial proofs
** TODO Implement Reiter tactic
:PROPERTIES:
:ESTIMATE: 2hr
:END:
:LOGBOOK:
CLOCK: [2020-01-05 Sun 15:24]
CLOCK: [2020-01-05 Sun 14:42]--[2020-01-05 Sun 15:00] =>  0:18
#+BEGIN: clocktable :scope subtree :maxlevel 2
#+CAPTION: Clock summary at [2020-01-05 Sun 15:23]
| Headline                    | Time   |      |
|-----------------------------+--------+------|
| *Total time*                | *2:35* |      |
|-----------------------------+--------+------|
| \_  Implement Reiter tactic |        | 2:35 |
#+END:

CLOCK: [2020-01-05 Sun 14:09]--[2020-01-05 Sun 14:18] =>  0:09
CLOCK: [2020-01-05 Sun 13:40]--[2020-01-05 Sun 13:49] =>  0:09
CLOCK: [2020-01-05 Sun 08:58]--[2020-01-05 Sun 10:00] =>  1:02
CLOCK: [2020-01-04 Sat 22:21]--[2020-01-04 Sat 22:57] =>  0:36
CLOCK: [2020-01-02 Thu 17:51]--[2020-01-02 Thu 17:57] =>  0:06
:END:
- Check if focused figure is an initial formula
- If so, then place initial over a hole, duplicate, and replace initial with
  duplicated initials with holes
*** DONE Walk through code, and identify needed steps
:PROPERTIES:
:ESTIMATE: 20min
:END:
:LOGBOOK:
CLOCK: [2020-01-02 Thu 17:35]--[2020-01-02 Thu 17:50] =>  0:15
:END:
*** Notes
Arrg.. very frustrated. I've implemented the expected logic, but nothing's
happening. I feel like the program has fallen out of my head, and it's
distressing to learn that program is so poorly organized, and/or in general it's
so easy to loose track of how a program works.

Feeling like my abilities are so far from where I wish they were... :(
** TODO List all tactics
** TODO Add tutorial
*** Principles
**** Introduction and Elimination
**** Conjunction
***** Forming Collections
***** Making Selections
**** Implication
***** Drawing Connections
***** Producing Results
**** Disjunction
***** Adding Alternatives
***** Dealing with Outcomes
**** Negation
***** Rejecting Absurdity
** TODO UI
*** TODO Simple, menu-based UI to flesh out basic functionality
- A single menu location
*** TODO Develop a non-mathy, playful and intuitive representation for the notation
*** TODO Embed the proof transformation UI into the structures of the terms
- This means the representation must have natural *handles* for every tactic and
  logical move that can be made.
- This calls for an application of algebraic semiotics:
  - Each term has /functionality/ (elim/intro)
  - The structure of the representation must be a mapping to this functionality
  - Ditto with figure-level manipulations
*** TODO Develop highly intuitive disjunction elim
*** TODO Add interactive illumination of proof parts on hover/click
- When an operator is hovered over, illuminate scope of sub formulae
- Hover on assumption to illuminate all uses
- Indicate when formula is still under license of assumption
*** TODO Implement UI for cuts
** TODO Detect unsolvable proofs and alert user
** TODO Name
- ND Project
- Deduction + Education
  - de∘ed∘euc∘ea∘etion
  - edu∘deduction
  - (Educa|Deduc)iton
